#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.deployment.data.google_client_config.provider: Reading...
module.deployment.data.google_container_cluster.my_cluster: Reading...
module.deployment.data.google_client_config.provider: Read complete after 1s [id=projects/"off-net-dev"/regions/"northamerica-northeast1"/zones/<null>]
module.deployment.data.google_container_cluster.my_cluster: Read complete after 2s [id=projects/off-net-dev/locations/northamerica-northeast1/clusters/java-rest-app]
module.deployment.kubernetes_namespace.env: Refreshing state... [id=namespace-development]
module.deployment.kubernetes_service.my_service: Refreshing state... [id=default/my-service]
module.deployment.kubernetes_deployment.deployment: Refreshing state... [id=namespace-development/java-rest-app]
module.deployment.kubernetes_horizontal_pod_autoscaler_v2.java_rest_app_hpa: Refreshing state... [id=namespace-development/java-rest-app-hpa-kfqf]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.deployment.kubernetes_deployment.deployment will be updated in-place
  ~ resource "kubernetes_deployment" "deployment" {
        id               = "namespace-development/java-rest-app"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - name = "spring-boot-rest-app-1"
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - ephemeral-storage = "1Gi"
                                    }
                                  - name     = "spring-boot-rest-app-1"
                                  - requests = {
                                      - cpu               = "500m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "2Gi"
                                    }
                                },
                            ]
                        }
                    }
                ) -> null
              - "autopilot.gke.io/warden-version"      = "31.23.0-gke.9" -> null
            }
            name             = "java-rest-app"
            # (6 unchanged attributes hidden)
        }

      ~ spec {
          ~ replicas                  = "1" -> "3"
            # (4 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (18 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "northamerica-northeast1-docker.pkg.dev/off-net-dev/lendly-demo/spring-boot-rest-app:dev" -> "northamerica-northeast1-docker.pkg.dev/off-net-dev/lendly-demo/spring-boot-rest-app:latest"
                        name                       = "spring-boot-rest-app-1"
                        # (9 unchanged attributes hidden)

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null
                            # (2 unchanged attributes hidden)

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }

                        # (1 unchanged block hidden)
                    }

                  - security_context {
                      - run_as_non_root        = false -> null
                      - supplemental_groups    = [] -> null
                        # (4 unchanged attributes hidden)

                      - seccomp_profile {
                          - type              = "RuntimeDefault" -> null
                            # (1 unchanged attribute hidden)
                        }
                    }

                  - toleration {
                      - effect             = "NoSchedule" -> null
                      - key                = "kubernetes.io/arch" -> null
                      - operator           = "Equal" -> null
                      - value              = "amd64" -> null
                        # (1 unchanged attribute hidden)
                    }
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.deployment.kubernetes_service.my_service must be replaced
-/+ resource "kubernetes_service" "my_service" {
      ~ id                     = "default/my-service" -> (known after apply)
      ~ status                 = [
          - {
              - load_balancer = [
                  - {
                      - ingress = [
                          - {
                              - ip       = "34.95.34.41"
                                # (1 unchanged attribute hidden)
                            },
                        ]
                    },
                ]
            },
        ] -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {
              - "cloud.google.com/neg" = jsonencode(
                    {
                      - ingress = true
                    }
                )
            } -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "my-service"
          ~ namespace        = "default" -> "namespace-development" # forces replacement
          ~ resource_version = "19724" -> (known after apply)
          ~ uid              = "ba59bac3-ec38-4030-bff2-48f191591565" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          ~ cluster_ip                        = "34.118.236.149" -> (known after apply)
          ~ cluster_ips                       = [
              - "34.118.236.149",
            ] -> (known after apply)
          - external_ips                      = [] -> null
          ~ external_traffic_policy           = "Cluster" -> (known after apply)
          ~ health_check_node_port            = 0 -> (known after apply)
          ~ internal_traffic_policy           = "Cluster" -> (known after apply)
          ~ ip_families                       = [
              - "IPv4",
            ] -> (known after apply)
          ~ ip_family_policy                  = "SingleStack" -> (known after apply)
          - load_balancer_source_ranges       = [] -> null
            # (8 unchanged attributes hidden)

          ~ port {
                name         = null
              ~ node_port    = 30165 -> (known after apply)
                # (4 unchanged attributes hidden)
            }

          ~ session_affinity_config (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*